**FREE

  //------------------------------------------------------------------------
  // DWS0260PR - Copy File for DWS0260
  //------------------------------------------------------------------------
  dcl-pr Validate_Product char(1);
    in_product char(10);
    out_msg char(60);
  end-pr;
